TexasInstruments/mcal_am263x/mcal/Spi/V0/hw_mcspi.h
/* ======================================================================
 *   Copyright (C) 2023-2024 Texas Instruments Incorporated
 *
 *   All rights reserved. Property of Texas Instruments Incorporated.
 *   Restricted rights to use, duplicate or disclose this code are
 *   granted through contract.
 *
 *   The program may not be used without the written permission
 *   of Texas Instruments Incorporated or against the terms and conditions
 *   stipulated in the agreement under which this program has been
 *   supplied.
 * ==================================================================== */

/**
 *
 *  \file   hw_mcspi.h
 *
 *  \brief  register-level header file for MCSPI
 *
 **/

#ifndef HW_MCSPI_H_
#define HW_MCSPI_H_

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************************
 * Register Definitions
 *****************************************************************************/
#define MCSPI_HL_REV       ((uint32)0x0U)
#define MCSPI_HL_HWINFO    ((uint32)0x4U)
#define MCSPI_HL_SYSCONFIG ((uint32)0x10U)
#define MCSPI_REVISION     ((uint32)0x100U)
#define MCSPI_SYSCONFIG    ((uint32)0x110U)
#define MCSPI_SYSSTATUS    ((uint32)0x114U)
#define MCSPI_IRQSTATUS    ((uint32)0x118U)
#define MCSPI_IRQENABLE    ((uint32)0x11cU)
#define MCSPI_WAKEUPENABLE ((uint32)0x120U)
#define MCSPI_SYST         ((uint32)0x124U)
#define MCSPI_MODULCTRL    ((uint32)0x128U)
#define MCSPI_CH0CONF      ((uint32)0x12cU)
#define MCSPI_CH0STAT      ((uint32)0x130U)
#define MCSPI_CH0CTRL      ((uint32)0x134U)
#define MCSPI_TX0          ((uint32)0x138U)
#define MCSPI_RX0          ((uint32)0x13cU)
#define MCSPI_CH1CONF      ((uint32)0x140U)
#define MCSPI_CH1STAT      ((uint32)0x144U)
#define MCSPI_CH1CTRL      ((uint32)0x148U)
#define MCSPI_TX1          ((uint32)0x14cU)
#define MCSPI_RX1          ((uint32)0x150U)
#define MCSPI_CH2CONF      ((uint32)0x154U)
#define MCSPI_CH2STAT      ((uint32)0x158U)
#define MCSPI_CH2CTRL      ((uint32)0x15cU)
#define MCSPI_TX2          ((uint32)0x160U)
#define MCSPI_RX2          ((uint32)0x164U)
#define MCSPI_CH3CONF      ((uint32)0x168U)
#define MCSPI_CH3STAT      ((uint32)0x16cU)
#define MCSPI_CH3CTRL      ((uint32)0x170U)
#define MCSPI_TX3          ((uint32)0x174U)
#define MCSPI_RX3          ((uint32)0x178U)
#define MCSPI_XFERLEVEL    ((uint32)0x17cU)

/******************************************************************************
 * Field Definition Macros
 ******************************************************************************/

#define MCSPI_HL_REV_REVISION_SHIFT ((uint32)0U)
#define MCSPI_HL_REV_REVISION_MASK  ((uint32)0xffffffffU)

#define MCSPI_HL_HWINFO_USEFIFO_SHIFT  ((uint32)0U)
#define MCSPI_HL_HWINFO_USEFIFO_MASK   ((uint32)0x00000001U)
#define MCSPI_HL_HWINFO_USEFIFO_FIFOEN ((uint32)1U)
#define MCSPI_HL_HWINFO_USEFIFO_NOFIFO ((uint32)0U)

#define MCSPI_HL_HWINFO_FFNBYTE_SHIFT      ((uint32)1U)
#define MCSPI_HL_HWINFO_FFNBYTE_MASK       ((uint32)0x0000003eU)
#define MCSPI_HL_HWINFO_FFNBYTE_FF16BYTES  ((uint32)1U)
#define MCSPI_HL_HWINFO_FFNBYTE_FF32BYTES  ((uint32)2U)
#define MCSPI_HL_HWINFO_FFNBYTE_FF64BYTES  ((uint32)4U)
#define MCSPI_HL_HWINFO_FFNBYTE_FF128BYTES ((uint32)8U)
#define MCSPI_HL_HWINFO_FFNBYTE_FF256BYTES ((uint32)16U)

#define MCSPI_HL_HWINFO_RSVD_SHIFT ((uint32)7U)
#define MCSPI_HL_HWINFO_RSVD_MASK  ((uint32)0xffffff80U)

#define MCSPI_HL_HWINFO_RETMODE_SHIFT     ((uint32)6U)
#define MCSPI_HL_HWINFO_RETMODE_MASK      ((uint32)0x00000040U)
#define MCSPI_HL_HWINFO_RETMODE_NORETMODE ((uint32)0U)
#define MCSPI_HL_HWINFO_RETMODE_RETMODEEN ((uint32)1U)

#define MCSPI_HL_SYSCONFIG_IDLEMODE_SHIFT           ((uint32)2U)
#define MCSPI_HL_SYSCONFIG_IDLEMODE_MASK            ((uint32)0x0000000cU)
#define MCSPI_HL_SYSCONFIG_IDLEMODE_SMARTIDLEWAKEUP ((uint32)3U)
#define MCSPI_HL_SYSCONFIG_IDLEMODE_FORCEIDLE       ((uint32)0U)
#define MCSPI_HL_SYSCONFIG_IDLEMODE_NOIDLE          ((uint32)1U)
#define MCSPI_HL_SYSCONFIG_IDLEMODE_SMARTIDLE       ((uint32)2U)

#define MCSPI_HL_SYSCONFIG_RSVD_SHIFT ((uint32)4U)
#define MCSPI_HL_SYSCONFIG_RSVD_MASK  ((uint32)0xfffffff0U)

#define MCSPI_HL_SYSCONFIG_SOFTRESET_SHIFT        ((uint32)0U)
#define MCSPI_HL_SYSCONFIG_SOFTRESET_MASK         ((uint32)0x00000001U)
#define MCSPI_HL_SYSCONFIG_SOFTRESET_RESETDONE    ((uint32)0U)
#define MCSPI_HL_SYSCONFIG_SOFTRESET_NOACTION     ((uint32)0U)
#define MCSPI_HL_SYSCONFIG_SOFTRESET_SOFTRESET    ((uint32)1U)
#define MCSPI_HL_SYSCONFIG_SOFTRESET_RESETONGOING ((uint32)1U)

#define MCSPI_HL_SYSCONFIG_FREEEMU_SHIFT  ((uint32)1U)
#define MCSPI_HL_SYSCONFIG_FREEEMU_MASK   ((uint32)0x00000002U)
#define MCSPI_HL_SYSCONFIG_FREEEMU_EMUDIS ((uint32)1U)
#define MCSPI_HL_SYSCONFIG_FREEEMU_EMUEN  ((uint32)0U)

#define MCSPI_REVISION_REVISION_SHIFT ((uint32)0U)
#define MCSPI_REVISION_REVISION_MASK  ((uint32)0xffffffffU)

#define MCSPI_SYSCONFIG_SIDLEMODE_SHIFT             ((uint32)3U)
#define MCSPI_SYSCONFIG_SIDLEMODE_MASK              ((uint32)0x00000018U)
#define MCSPI_SYSCONFIG_SIDLEMODE_FORCE             ((uint32)0U)
#define MCSPI_SYSCONFIG_SIDLEMODE_NO                ((uint32)1U)
#define MCSPI_SYSCONFIG_SIDLEMODE_SMART             ((uint32)2U)
#define MCSPI_SYSCONFIG_SIDLEMODE_SMART_IDLE_WAKEUP ((uint32)3U)

#define MCSPI_SYSCONFIG_RESERVED_14_SHIFT ((uint32)10U)
#define MCSPI_SYSCONFIG_RESERVED_14_MASK  ((uint32)0xfffffc00U)

#define MCSPI_SYSCONFIG_SOFTRESET_SHIFT ((uint32)1U)
#define MCSPI_SYSCONFIG_SOFTRESET_MASK  ((uint32)0x00000002U)
#define MCSPI_SYSCONFIG_SOFTRESET_OFF   ((uint32)0U)
#define MCSPI_SYSCONFIG_SOFTRESET_ON    ((uint32)1U)

#define MCSPI_SYSCONFIG_CLOCKACTIVITY_SHIFT ((uint32)8U)
#define MCSPI_SYSCONFIG_CLOCKACTIVITY_MASK  ((uint32)0x00000300U)
#define MCSPI_SYSCONFIG_CLOCKACTIVITY_NONE  ((uint32)0U)
#define MCSPI_SYSCONFIG_CLOCKACTIVITY_OCP   ((uint32)1U)
#define MCSPI_SYSCONFIG_CLOCKACTIVITY_FUNC  ((uint32)2U)
#define MCSPI_SYSCONFIG_CLOCKACTIVITY_BOTH  ((uint32)3U)

#define MCSPI_SYSCONFIG_AUTOIDLE_SHIFT ((uint32)0U)
#define MCSPI_SYSCONFIG_AUTOIDLE_MASK  ((uint32)0x00000001U)
#define MCSPI_SYSCONFIG_AUTOIDLE_OFF   ((uint32)0U)
#define MCSPI_SYSCONFIG_AUTOIDLE_ON    ((uint32)1U)

