TexasInstruments/mcal_am263x/mcal/Spi/V0/hw_mcspi.h
#define MCSPI_SYSCONFIG_ENAWAKEUP_SHIFT    ((uint32)2U)
#define MCSPI_SYSCONFIG_ENAWAKEUP_MASK     ((uint32)0x00000004U)
#define MCSPI_SYSCONFIG_ENAWAKEUP_NOWAKEUP ((uint32)0U)
#define MCSPI_SYSCONFIG_ENAWAKEUP_ON       ((uint32)1U)

#define MCSPI_SYSCONFIG_RESERVED_15_SHIFT ((uint32)5U)
#define MCSPI_SYSCONFIG_RESERVED_15_MASK  ((uint32)0x000000e0U)

#define MCSPI_SYSSTATUS_RESERVED_16_SHIFT ((uint32)1U)
#define MCSPI_SYSSTATUS_RESERVED_16_MASK  ((uint32)0xfffffffeU)

#define MCSPI_SYSSTATUS_RESETDONE_SHIFT      ((uint32)0U)
#define MCSPI_SYSSTATUS_RESETDONE_MASK       ((uint32)0x00000001U)
#define MCSPI_SYSSTATUS_RESETDONE_INPROGRESS ((uint32)0U)
#define MCSPI_SYSSTATUS_RESETDONE_COMPLETED  ((uint32)1U)

#define MCSPI_IRQSTATUS_RESERVED_7_SHIFT ((uint32)15U)
#define MCSPI_IRQSTATUS_RESERVED_7_MASK  ((uint32)0x00008000U)

#define MCSPI_IRQSTATUS_RX3_FULL_SHIFT      ((uint32)14U)
#define MCSPI_IRQSTATUS_RX3_FULL_MASK       ((uint32)0x00004000U)
#define MCSPI_IRQSTATUS_RX3_FULL_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_RX3_FULL_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_RX3_FULL_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_RX3_FULL_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_RESERVED_8_SHIFT ((uint32)18U)
#define MCSPI_IRQSTATUS_RESERVED_8_MASK  ((uint32)0xfffc0000U)

#define MCSPI_IRQSTATUS_WKS_SHIFT      ((uint32)16U)
#define MCSPI_IRQSTATUS_WKS_MASK       ((uint32)0x00010000U)
#define MCSPI_IRQSTATUS_WKS_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_WKS_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_WKS_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_WKS_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_RESERVED_9_SHIFT ((uint32)11U)
#define MCSPI_IRQSTATUS_RESERVED_9_MASK  ((uint32)0x00000800U)

#define MCSPI_IRQSTATUS_RX2_FULL_SHIFT      ((uint32)10U)
#define MCSPI_IRQSTATUS_RX2_FULL_MASK       ((uint32)0x00000400U)
#define MCSPI_IRQSTATUS_RX2_FULL_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_RX2_FULL_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_RX2_FULL_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_RX2_FULL_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_TX3_EMPTY_SHIFT      ((uint32)12U)
#define MCSPI_IRQSTATUS_TX3_EMPTY_MASK       ((uint32)0x00001000U)
#define MCSPI_IRQSTATUS_TX3_EMPTY_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_TX3_EMPTY_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_TX3_EMPTY_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_TX3_EMPTY_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_RX1_FULL_SHIFT      ((uint32)6U)
#define MCSPI_IRQSTATUS_RX1_FULL_MASK       ((uint32)0x00000040U)
#define MCSPI_IRQSTATUS_RX1_FULL_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_RX1_FULL_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_RX1_FULL_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_RX1_FULL_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_TX3_UNDERFLOW_SHIFT      ((uint32)13U)
#define MCSPI_IRQSTATUS_TX3_UNDERFLOW_MASK       ((uint32)0x00002000U)
#define MCSPI_IRQSTATUS_TX3_UNDERFLOW_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_TX3_UNDERFLOW_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_TX3_UNDERFLOW_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_TX3_UNDERFLOW_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_TX2_EMPTY_SHIFT      ((uint32)8U)
#define MCSPI_IRQSTATUS_TX2_EMPTY_MASK       ((uint32)0x00000100U)
#define MCSPI_IRQSTATUS_TX2_EMPTY_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_TX2_EMPTY_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_TX2_EMPTY_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_TX2_EMPTY_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_TX2_UNDERFLOW_SHIFT      ((uint32)9U)
#define MCSPI_IRQSTATUS_TX2_UNDERFLOW_MASK       ((uint32)0x00000200U)
#define MCSPI_IRQSTATUS_TX2_UNDERFLOW_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_TX2_UNDERFLOW_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_TX2_UNDERFLOW_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_TX2_UNDERFLOW_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_TX1_EMPTY_SHIFT      ((uint32)4U)
#define MCSPI_IRQSTATUS_TX1_EMPTY_MASK       ((uint32)0x00000010U)
#define MCSPI_IRQSTATUS_TX1_EMPTY_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_TX1_EMPTY_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_TX1_EMPTY_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_TX1_EMPTY_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_TX0_UNDERFLOW_SHIFT      ((uint32)1U)
#define MCSPI_IRQSTATUS_TX0_UNDERFLOW_MASK       ((uint32)0x00000002U)
#define MCSPI_IRQSTATUS_TX0_UNDERFLOW_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_TX0_UNDERFLOW_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_TX0_UNDERFLOW_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_TX0_UNDERFLOW_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_TX1_UNDERFLOW_SHIFT      ((uint32)5U)
#define MCSPI_IRQSTATUS_TX1_UNDERFLOW_MASK       ((uint32)0x00000020U)
#define MCSPI_IRQSTATUS_TX1_UNDERFLOW_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_TX1_UNDERFLOW_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_TX1_UNDERFLOW_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_TX1_UNDERFLOW_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_RESERVED_10_SHIFT ((uint32)7U)
#define MCSPI_IRQSTATUS_RESERVED_10_MASK  ((uint32)0x00000080U)

#define MCSPI_IRQSTATUS_RX0_FULL_SHIFT      ((uint32)2U)
#define MCSPI_IRQSTATUS_RX0_FULL_MASK       ((uint32)0x00000004U)
#define MCSPI_IRQSTATUS_RX0_FULL_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_RX0_FULL_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_RX0_FULL_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_RX0_FULL_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_RX0_OVERFLOW_SHIFT      ((uint32)3U)
#define MCSPI_IRQSTATUS_RX0_OVERFLOW_MASK       ((uint32)0x00000008U)
#define MCSPI_IRQSTATUS_RX0_OVERFLOW_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_RX0_OVERFLOW_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_RX0_OVERFLOW_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_RX0_OVERFLOW_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_TX0_EMPTY_SHIFT      ((uint32)0U)
#define MCSPI_IRQSTATUS_TX0_EMPTY_MASK       ((uint32)0x00000001U)
#define MCSPI_IRQSTATUS_TX0_EMPTY_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_TX0_EMPTY_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_TX0_EMPTY_NOEFFECT_W ((uint32)0U)
#define MCSPI_IRQSTATUS_TX0_EMPTY_CLEARSRC_W ((uint32)1U)

#define MCSPI_IRQSTATUS_EOW_SHIFT      ((uint32)17U)
#define MCSPI_IRQSTATUS_EOW_MASK       ((uint32)0x00020000U)
#define MCSPI_IRQSTATUS_EOW_NOEVNT_R   ((uint32)0U)
#define MCSPI_IRQSTATUS_EOW_EVNT_R     ((uint32)1U)
#define MCSPI_IRQSTATUS_EOW_CLEARSRC_W ((uint32)1U)
#define MCSPI_IRQSTATUS_EOW_NOEFFECT_W ((uint32)0U)

#define MCSPI_IRQENABLE_RESERVED_3_SHIFT ((uint32)7U)
#define MCSPI_IRQENABLE_RESERVED_3_MASK  ((uint32)0x00000080U)

#define MCSPI_IRQENABLE_TX2_UNDERFLOW_ENABLE_SHIFT       ((uint32)9U)
#define MCSPI_IRQENABLE_TX2_UNDERFLOW_ENABLE_MASK        ((uint32)0x00000200U)
#define MCSPI_IRQENABLE_TX2_UNDERFLOW_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_TX2_UNDERFLOW_ENABLE_IRQENABLED  ((uint32)1U)

