TexasInstruments/mcal_am263x/mcal/Spi/V0/hw_mcspi.h
#define MCSPI_IRQENABLE_RESERVED_4_SHIFT ((uint32)15U)
#define MCSPI_IRQENABLE_RESERVED_4_MASK  ((uint32)0x00008000U)

#define MCSPI_IRQENABLE_TX0_EMPTY_ENABLE_SHIFT       ((uint32)0U)
#define MCSPI_IRQENABLE_TX0_EMPTY_ENABLE_MASK        ((uint32)0x00000001U)
#define MCSPI_IRQENABLE_TX0_EMPTY_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_TX0_EMPTY_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_RX0_FULL_ENABLE_SHIFT       ((uint32)2U)
#define MCSPI_IRQENABLE_RX0_FULL_ENABLE_MASK        ((uint32)0x00000004U)
#define MCSPI_IRQENABLE_RX0_FULL_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_RX0_FULL_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_TX1_EMPTY_ENABLE_SHIFT       ((uint32)4U)
#define MCSPI_IRQENABLE_TX1_EMPTY_ENABLE_MASK        ((uint32)0x00000010U)
#define MCSPI_IRQENABLE_TX1_EMPTY_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_TX1_EMPTY_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_RX1_FULL_ENABLE_SHIFT       ((uint32)6U)
#define MCSPI_IRQENABLE_RX1_FULL_ENABLE_MASK        ((uint32)0x00000040U)
#define MCSPI_IRQENABLE_RX1_FULL_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_RX1_FULL_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_TX3_EMPTY_ENABLE_SHIFT       ((uint32)12U)
#define MCSPI_IRQENABLE_TX3_EMPTY_ENABLE_MASK        ((uint32)0x00001000U)
#define MCSPI_IRQENABLE_TX3_EMPTY_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_TX3_EMPTY_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_TX0_UNDERFLOW_ENABLE_SHIFT       ((uint32)1U)
#define MCSPI_IRQENABLE_TX0_UNDERFLOW_ENABLE_MASK        ((uint32)0x00000002U)
#define MCSPI_IRQENABLE_TX0_UNDERFLOW_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_TX0_UNDERFLOW_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_RX0_OVERFLOW_ENABLE_SHIFT       ((uint32)3U)
#define MCSPI_IRQENABLE_RX0_OVERFLOW_ENABLE_MASK        ((uint32)0x00000008U)
#define MCSPI_IRQENABLE_RX0_OVERFLOW_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_RX0_OVERFLOW_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_RX3_FULL_ENABLE_SHIFT       ((uint32)14U)
#define MCSPI_IRQENABLE_RX3_FULL_ENABLE_MASK        ((uint32)0x00004000U)
#define MCSPI_IRQENABLE_RX3_FULL_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_RX3_FULL_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_RESERVED_5_SHIFT ((uint32)18U)
#define MCSPI_IRQENABLE_RESERVED_5_MASK  ((uint32)0xfffc0000U)

#define MCSPI_IRQENABLE_RESERVED_6_SHIFT ((uint32)11U)
#define MCSPI_IRQENABLE_RESERVED_6_MASK  ((uint32)0x00000800U)

#define MCSPI_IRQENABLE_WKE_SHIFT       ((uint32)16U)
#define MCSPI_IRQENABLE_WKE_MASK        ((uint32)0x00010000U)
#define MCSPI_IRQENABLE_WKE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_WKE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_TX2_EMPTY_ENABLE_SHIFT       ((uint32)8U)
#define MCSPI_IRQENABLE_TX2_EMPTY_ENABLE_MASK        ((uint32)0x00000100U)
#define MCSPI_IRQENABLE_TX2_EMPTY_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_TX2_EMPTY_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_RX2_FULL_ENABLE_SHIFT       ((uint32)10U)
#define MCSPI_IRQENABLE_RX2_FULL_ENABLE_MASK        ((uint32)0x00000400U)
#define MCSPI_IRQENABLE_RX2_FULL_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_RX2_FULL_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_TX3_UNDERFLOW_ENABLE_SHIFT       ((uint32)13U)
#define MCSPI_IRQENABLE_TX3_UNDERFLOW_ENABLE_MASK        ((uint32)0x00002000U)
#define MCSPI_IRQENABLE_TX3_UNDERFLOW_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_TX3_UNDERFLOW_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_TX1_UNDERFLOW_ENABLE_SHIFT       ((uint32)5U)
#define MCSPI_IRQENABLE_TX1_UNDERFLOW_ENABLE_MASK        ((uint32)0x00000020U)
#define MCSPI_IRQENABLE_TX1_UNDERFLOW_ENABLE_IRQDISABLED ((uint32)0U)
#define MCSPI_IRQENABLE_TX1_UNDERFLOW_ENABLE_IRQENABLED  ((uint32)1U)

#define MCSPI_IRQENABLE_EOW_ENABLE_SHIFT       ((uint32)17U)
#define MCSPI_IRQENABLE_EOW_ENABLE_MASK        ((uint32)0x00020000U)
#define MCSPI_IRQENABLE_EOW_ENABLE_IRQENABLED  ((uint32)1U)
#define MCSPI_IRQENABLE_EOW_ENABLE_IRQDISABLED ((uint32)0U)

#define MCSPI_WAKEUPENABLE_RESERVED_18_SHIFT ((uint32)1U)
#define MCSPI_WAKEUPENABLE_RESERVED_18_MASK  ((uint32)0xfffffffeU)

#define MCSPI_WAKEUPENABLE_WKEN_SHIFT    ((uint32)0U)
#define MCSPI_WAKEUPENABLE_WKEN_MASK     ((uint32)0x00000001U)
#define MCSPI_WAKEUPENABLE_WKEN_NOWAKEUP ((uint32)0U)
#define MCSPI_WAKEUPENABLE_WKEN_WAKEUP   ((uint32)1U)

#define MCSPI_SYST_SPIEN_2_SHIFT ((uint32)2U)
#define MCSPI_SYST_SPIEN_2_MASK  ((uint32)0x00000004U)

#define MCSPI_SYST_WAKD_SHIFT      ((uint32)7U)
#define MCSPI_SYST_WAKD_MASK       ((uint32)0x00000080U)
#define MCSPI_SYST_WAKD_DRIVENLOW  ((uint32)0U)
#define MCSPI_SYST_WAKD_DRIVENHIGH ((uint32)1U)

#define MCSPI_SYST_SPIDAT_0_SHIFT ((uint32)4U)
#define MCSPI_SYST_SPIDAT_0_MASK  ((uint32)0x00000010U)

#define MCSPI_SYST_SPIEN_1_SHIFT ((uint32)1U)
#define MCSPI_SYST_SPIEN_1_MASK  ((uint32)0x00000002U)

#define MCSPI_SYST_RESERVED_17_SHIFT ((uint32)12U)
#define MCSPI_SYST_RESERVED_17_MASK  ((uint32)0xfffff000U)

#define MCSPI_SYST_SPIDATDIR1_SHIFT ((uint32)9U)
#define MCSPI_SYST_SPIDATDIR1_MASK  ((uint32)0x00000200U)
#define MCSPI_SYST_SPIDATDIR1_OUT   ((uint32)0U)
#define MCSPI_SYST_SPIDATDIR1_IN    ((uint32)1U)

#define MCSPI_SYST_SSB_SHIFT      ((uint32)11U)
#define MCSPI_SYST_SSB_MASK       ((uint32)0x00000800U)
#define MCSPI_SYST_SSB_OFF        ((uint32)0U)
#define MCSPI_SYST_SSB_SETTHEMALL ((uint32)1U)

#define MCSPI_SYST_SPICLK_SHIFT ((uint32)6U)
#define MCSPI_SYST_SPICLK_MASK  ((uint32)0x00000040U)

#define MCSPI_SYST_SPIDATDIR0_SHIFT ((uint32)8U)
#define MCSPI_SYST_SPIDATDIR0_MASK  ((uint32)0x00000100U)
#define MCSPI_SYST_SPIDATDIR0_OUT   ((uint32)0U)
#define MCSPI_SYST_SPIDATDIR0_IN    ((uint32)1U)

#define MCSPI_SYST_SPIENDIR_SHIFT ((uint32)10U)
#define MCSPI_SYST_SPIENDIR_MASK  ((uint32)0x00000400U)
#define MCSPI_SYST_SPIENDIR_OUT   ((uint32)0U)
#define MCSPI_SYST_SPIENDIR_IN    ((uint32)1U)

#define MCSPI_SYST_SPIEN_3_SHIFT ((uint32)3U)
#define MCSPI_SYST_SPIEN_3_MASK  ((uint32)0x00000008U)

