TexasInstruments/mcal_am263x/mcal/Spi/V0/hw_mcspi.h
#define MCSPI_SYST_SPIEN_0_SHIFT ((uint32)0U)
#define MCSPI_SYST_SPIEN_0_MASK  ((uint32)0x00000001U)

#define MCSPI_SYST_SPIDAT_1_SHIFT ((uint32)5U)
#define MCSPI_SYST_SPIDAT_1_MASK  ((uint32)0x00000020U)

#define MCSPI_MODULCTRL_MS_SHIFT  ((uint32)2U)
#define MCSPI_MODULCTRL_MS_MASK   ((uint32)0x00000004U)
#define MCSPI_MODULCTRL_MS_MASTER ((uint32)0U)
#define MCSPI_MODULCTRL_MS_SLAVE  ((uint32)1U)

#define MCSPI_MODULCTRL_RESERVED_11_SHIFT ((uint32)9U)
#define MCSPI_MODULCTRL_RESERVED_11_MASK  ((uint32)0xfffffe00U)

#define MCSPI_MODULCTRL_SYSTEM_TEST_SHIFT ((uint32)3U)
#define MCSPI_MODULCTRL_SYSTEM_TEST_MASK  ((uint32)0x00000008U)
#define MCSPI_MODULCTRL_SYSTEM_TEST_OFF   ((uint32)0U)
#define MCSPI_MODULCTRL_SYSTEM_TEST_ON    ((uint32)1U)

#define MCSPI_MODULCTRL_SINGLE_SHIFT  ((uint32)0U)
#define MCSPI_MODULCTRL_SINGLE_MASK   ((uint32)0x00000001U)
#define MCSPI_MODULCTRL_SINGLE_MULTI  ((uint32)0U)
#define MCSPI_MODULCTRL_SINGLE_SINGLE ((uint32)1U)

#define MCSPI_MODULCTRL_PIN34_SHIFT    ((uint32)1U)
#define MCSPI_MODULCTRL_PIN34_MASK     ((uint32)0x00000002U)
#define MCSPI_MODULCTRL_PIN34_3PINMODE ((uint32)1U)
#define MCSPI_MODULCTRL_PIN34_4PINMODE ((uint32)0U)

#define MCSPI_MODULCTRL_INITDLY_SHIFT    ((uint32)4U)
#define MCSPI_MODULCTRL_INITDLY_MASK     ((uint32)0x00000070U)
#define MCSPI_MODULCTRL_INITDLY_4CLKDLY  ((uint32)1U)
#define MCSPI_MODULCTRL_INITDLY_NODELAY  ((uint32)0U)
#define MCSPI_MODULCTRL_INITDLY_8CLKDLY  ((uint32)2U)
#define MCSPI_MODULCTRL_INITDLY_16CLKDLY ((uint32)3U)
#define MCSPI_MODULCTRL_INITDLY_32CLKDLY ((uint32)4U)

#define MCSPI_MODULCTRL_MOA_SHIFT         ((uint32)7U)
#define MCSPI_MODULCTRL_MOA_MASK          ((uint32)0x00000080U)
#define MCSPI_MODULCTRL_MOA_MULTIACCES    ((uint32)1U)
#define MCSPI_MODULCTRL_MOA_NOMULTIACCESS ((uint32)0U)

#define MCSPI_MODULCTRL_FDAA_SHIFT       ((uint32)8U)
#define MCSPI_MODULCTRL_FDAA_MASK        ((uint32)0x00000100U)
#define MCSPI_MODULCTRL_FDAA_SHADOWREGEN ((uint32)1U)
#define MCSPI_MODULCTRL_FDAA_NOSHADOWREG ((uint32)0U)

#define MCSPI_CH0CONF_CLKD_SHIFT    ((uint32)2U)
#define MCSPI_CH0CONF_CLKD_MASK     ((uint32)0x0000003cU)
#define MCSPI_CH0CONF_CLKD_DIVBY4K  ((uint32)12U)
#define MCSPI_CH0CONF_CLKD_DIVBY8   ((uint32)3U)
#define MCSPI_CH0CONF_CLKD_DIVBY8K  ((uint32)13U)
#define MCSPI_CH0CONF_CLKD_DIVBY2K  ((uint32)11U)
#define MCSPI_CH0CONF_CLKD_DIVBY1K  ((uint32)10U)
#define MCSPI_CH0CONF_CLKD_DIVBY512 ((uint32)9U)
#define MCSPI_CH0CONF_CLKD_DIVBY32K ((uint32)15U)
#define MCSPI_CH0CONF_CLKD_DIVBY4   ((uint32)2U)
#define MCSPI_CH0CONF_CLKD_DIVBY1   ((uint32)0U)
#define MCSPI_CH0CONF_CLKD_DIVBY64  ((uint32)6U)
#define MCSPI_CH0CONF_CLKD_DIVBY256 ((uint32)8U)
#define MCSPI_CH0CONF_CLKD_DIVBY128 ((uint32)7U)
#define MCSPI_CH0CONF_CLKD_DIVBY32  ((uint32)5U)
#define MCSPI_CH0CONF_CLKD_DIVBY16K ((uint32)14U)
#define MCSPI_CH0CONF_CLKD_DIVBY16  ((uint32)4U)
#define MCSPI_CH0CONF_CLKD_DIVBY2   ((uint32)1U)

#define MCSPI_CH0CONF_RESERVED_0_SHIFT ((uint32)30U)
#define MCSPI_CH0CONF_RESERVED_0_MASK  ((uint32)0xc0000000U)

#define MCSPI_CH0CONF_PHA_SHIFT ((uint32)0U)
#define MCSPI_CH0CONF_PHA_MASK  ((uint32)0x00000001U)
#define MCSPI_CH0CONF_PHA_ODD   ((uint32)0U)
#define MCSPI_CH0CONF_PHA_EVEN  ((uint32)1U)

#define MCSPI_CH0CONF_TURBO_SHIFT ((uint32)19U)
#define MCSPI_CH0CONF_TURBO_MASK  ((uint32)0x00080000U)
#define MCSPI_CH0CONF_TURBO_TURBO ((uint32)1U)
#define MCSPI_CH0CONF_TURBO_OFF   ((uint32)0U)

#define MCSPI_CH0CONF_SPIENSLV_SHIFT  ((uint32)21U)
#define MCSPI_CH0CONF_SPIENSLV_MASK   ((uint32)0x00600000U)
#define MCSPI_CH0CONF_SPIENSLV_SPIEN2 ((uint32)2U)
#define MCSPI_CH0CONF_SPIENSLV_SPIEN3 ((uint32)3U)
#define MCSPI_CH0CONF_SPIENSLV_SPIEN0 ((uint32)0U)
#define MCSPI_CH0CONF_SPIENSLV_SPIEN1 ((uint32)1U)

#define MCSPI_CH0CONF_DPE0_SHIFT    ((uint32)16U)
#define MCSPI_CH0CONF_DPE0_MASK     ((uint32)0x00010000U)
#define MCSPI_CH0CONF_DPE0_DISABLED ((uint32)1U)
#define MCSPI_CH0CONF_DPE0_ENABLED  ((uint32)0U)

#define MCSPI_CH0CONF_IS_SHIFT ((uint32)18U)
#define MCSPI_CH0CONF_IS_MASK  ((uint32)0x00040000U)
#define MCSPI_CH0CONF_IS_LINE0 ((uint32)0U)
#define MCSPI_CH0CONF_IS_LINE1 ((uint32)1U)

#define MCSPI_CH0CONF_DMAR_SHIFT    ((uint32)15U)
#define MCSPI_CH0CONF_DMAR_MASK     ((uint32)0x00008000U)
#define MCSPI_CH0CONF_DMAR_DISABLED ((uint32)0U)
#define MCSPI_CH0CONF_DMAR_ENABLED  ((uint32)1U)

#define MCSPI_CH0CONF_FORCE_SHIFT    ((uint32)20U)
#define MCSPI_CH0CONF_FORCE_MASK     ((uint32)0x00100000U)
#define MCSPI_CH0CONF_FORCE_DEASSERT ((uint32)0U)
#define MCSPI_CH0CONF_FORCE_ASSERT   ((uint32)1U)

#define MCSPI_CH0CONF_WL_SHIFT  ((uint32)7U)
#define MCSPI_CH0CONF_WL_MASK   ((uint32)0x00000f80U)
#define MCSPI_CH0CONF_WL_21BITS ((uint32)20U)
#define MCSPI_CH0CONF_WL_26BITS ((uint32)25U)
#define MCSPI_CH0CONF_WL_18BITS ((uint32)17U)
#define MCSPI_CH0CONF_WL_20BITS ((uint32)19U)
#define MCSPI_CH0CONF_WL_5BITS  ((uint32)4U)
#define MCSPI_CH0CONF_WL_6BITS  ((uint32)5U)
#define MCSPI_CH0CONF_WL_11BITS ((uint32)10U)
#define MCSPI_CH0CONF_WL_8BITS  ((uint32)7U)
#define MCSPI_CH0CONF_WL_13BITS ((uint32)12U)
#define MCSPI_CH0CONF_WL_29BITS ((uint32)28U)
#define MCSPI_CH0CONF_WL_12BITS ((uint32)11U)
#define MCSPI_CH0CONF_WL_32BITS ((uint32)31U)
#define MCSPI_CH0CONF_WL_31BITS ((uint32)30U)
#define MCSPI_CH0CONF_WL_30BITS ((uint32)29U)
#define MCSPI_CH0CONF_WL_9BITS  ((uint32)8U)
#define MCSPI_CH0CONF_WL_7BITS  ((uint32)6U)
#define MCSPI_CH0CONF_WL_10BITS ((uint32)9U)
#define MCSPI_CH0CONF_WL_16BITS ((uint32)15U)
#define MCSPI_CH0CONF_WL_17BITS ((uint32)16U)
#define MCSPI_CH0CONF_WL_14BITS ((uint32)13U)
#define MCSPI_CH0CONF_WL_15BITS ((uint32)14U)
#define MCSPI_CH0CONF_WL_RSVD1  ((uint32)1U)
#define MCSPI_CH0CONF_WL_RSVD0  ((uint32)0U)
#define MCSPI_CH0CONF_WL_27BITS ((uint32)26U)
#define MCSPI_CH0CONF_WL_23BITS ((uint32)22U)
#define MCSPI_CH0CONF_WL_RSVD2  ((uint32)2U)
#define MCSPI_CH0CONF_WL_19BITS ((uint32)18U)
#define MCSPI_CH0CONF_WL_4BITS  ((uint32)3U)
#define MCSPI_CH0CONF_WL_25BITS ((uint32)24U)
#define MCSPI_CH0CONF_WL_24BITS ((uint32)23U)
#define MCSPI_CH0CONF_WL_22BITS ((uint32)21U)
#define MCSPI_CH0CONF_WL_28BITS ((uint32)27U)

#define MCSPI_CH0CONF_DPE1_SHIFT    ((uint32)17U)
#define MCSPI_CH0CONF_DPE1_MASK     ((uint32)0x00020000U)
#define MCSPI_CH0CONF_DPE1_ENABLED  ((uint32)0U)
#define MCSPI_CH0CONF_DPE1_DISABLED ((uint32)1U)

#define MCSPI_CH0CONF_EPOL_SHIFT      ((uint32)6U)
#define MCSPI_CH0CONF_EPOL_MASK       ((uint32)0x00000040U)
#define MCSPI_CH0CONF_EPOL_ACTIVELOW  ((uint32)1U)
#define MCSPI_CH0CONF_EPOL_ACTIVEHIGH ((uint32)0U)

#define MCSPI_CH0CONF_DMAW_SHIFT    ((uint32)14U)
#define MCSPI_CH0CONF_DMAW_MASK     ((uint32)0x00004000U)
#define MCSPI_CH0CONF_DMAW_ENABLED  ((uint32)1U)
#define MCSPI_CH0CONF_DMAW_DISABLED ((uint32)0U)

