TexasInstruments/mcal_am263x/mcal/Spi/V0/hw_mcspi.h
#define MCSPI_CH1CONF_FORCE_SHIFT    ((uint32)20U)
#define MCSPI_CH1CONF_FORCE_MASK     ((uint32)0x00100000U)
#define MCSPI_CH1CONF_FORCE_DEASSERT ((uint32)0U)
#define MCSPI_CH1CONF_FORCE_ASSERT   ((uint32)1U)

#define MCSPI_CH1CONF_WL_SHIFT  ((uint32)7U)
#define MCSPI_CH1CONF_WL_MASK   ((uint32)0x00000f80U)
#define MCSPI_CH1CONF_WL_21BITS ((uint32)20U)
#define MCSPI_CH1CONF_WL_26BITS ((uint32)25U)
#define MCSPI_CH1CONF_WL_18BITS ((uint32)17U)
#define MCSPI_CH1CONF_WL_20BITS ((uint32)19U)
#define MCSPI_CH1CONF_WL_5BITS  ((uint32)4U)
#define MCSPI_CH1CONF_WL_6BITS  ((uint32)5U)
#define MCSPI_CH1CONF_WL_11BITS ((uint32)10U)
#define MCSPI_CH1CONF_WL_8BITS  ((uint32)7U)
#define MCSPI_CH1CONF_WL_13BITS ((uint32)12U)
#define MCSPI_CH1CONF_WL_29BITS ((uint32)28U)
#define MCSPI_CH1CONF_WL_12BITS ((uint32)11U)
#define MCSPI_CH1CONF_WL_32BITS ((uint32)31U)
#define MCSPI_CH1CONF_WL_31BITS ((uint32)30U)
#define MCSPI_CH1CONF_WL_30BITS ((uint32)29U)
#define MCSPI_CH1CONF_WL_9BITS  ((uint32)8U)
#define MCSPI_CH1CONF_WL_7BITS  ((uint32)6U)
#define MCSPI_CH1CONF_WL_10BITS ((uint32)9U)
#define MCSPI_CH1CONF_WL_16BITS ((uint32)15U)
#define MCSPI_CH1CONF_WL_17BITS ((uint32)16U)
#define MCSPI_CH1CONF_WL_14BITS ((uint32)13U)
#define MCSPI_CH1CONF_WL_15BITS ((uint32)14U)
#define MCSPI_CH1CONF_WL_RSVD1  ((uint32)1U)
#define MCSPI_CH1CONF_WL_RSVD0  ((uint32)0U)
#define MCSPI_CH1CONF_WL_27BITS ((uint32)26U)
#define MCSPI_CH1CONF_WL_23BITS ((uint32)22U)
#define MCSPI_CH1CONF_WL_RSVD2  ((uint32)2U)
#define MCSPI_CH1CONF_WL_19BITS ((uint32)18U)
#define MCSPI_CH1CONF_WL_4BITS  ((uint32)3U)
#define MCSPI_CH1CONF_WL_25BITS ((uint32)24U)
#define MCSPI_CH1CONF_WL_24BITS ((uint32)23U)
#define MCSPI_CH1CONF_WL_22BITS ((uint32)21U)
#define MCSPI_CH1CONF_WL_28BITS ((uint32)27U)

#define MCSPI_CH1CONF_DPE1_SHIFT    ((uint32)17U)
#define MCSPI_CH1CONF_DPE1_MASK     ((uint32)0x00020000U)
#define MCSPI_CH1CONF_DPE1_ENABLED  ((uint32)0U)
#define MCSPI_CH1CONF_DPE1_DISABLED ((uint32)1U)

#define MCSPI_CH1CONF_EPOL_SHIFT      ((uint32)6U)
#define MCSPI_CH1CONF_EPOL_MASK       ((uint32)0x00000040U)
#define MCSPI_CH1CONF_EPOL_ACTIVELOW  ((uint32)1U)
#define MCSPI_CH1CONF_EPOL_ACTIVEHIGH ((uint32)0U)

#define MCSPI_CH1CONF_DMAW_SHIFT    ((uint32)14U)
#define MCSPI_CH1CONF_DMAW_MASK     ((uint32)0x00004000U)
#define MCSPI_CH1CONF_DMAW_ENABLED  ((uint32)1U)
#define MCSPI_CH1CONF_DMAW_DISABLED ((uint32)0U)

#define MCSPI_CH1CONF_TRM_SHIFT      ((uint32)12U)
#define MCSPI_CH1CONF_TRM_MASK       ((uint32)0x00003000U)
#define MCSPI_CH1CONF_TRM_TRANSONLY  ((uint32)2U)
#define MCSPI_CH1CONF_TRM_RSVD       ((uint32)3U)
#define MCSPI_CH1CONF_TRM_TRANSRECEI ((uint32)0U)
#define MCSPI_CH1CONF_TRM_RECEIVONLY ((uint32)1U)

#define MCSPI_CH1CONF_POL_SHIFT      ((uint32)1U)
#define MCSPI_CH1CONF_POL_MASK       ((uint32)0x00000002U)
#define MCSPI_CH1CONF_POL_ACTIVELOW  ((uint32)1U)
#define MCSPI_CH1CONF_POL_ACTIVEHIGH ((uint32)0U)

#define MCSPI_CH1CONF_SBE_SHIFT    ((uint32)23U)
#define MCSPI_CH1CONF_SBE_MASK     ((uint32)0x00800000U)
#define MCSPI_CH1CONF_SBE_DISABLED ((uint32)0U)
#define MCSPI_CH1CONF_SBE_ENABLED  ((uint32)1U)

#define MCSPI_CH1CONF_SBPOL_SHIFT     ((uint32)24U)
#define MCSPI_CH1CONF_SBPOL_MASK      ((uint32)0x01000000U)
#define MCSPI_CH1CONF_SBPOL_LOWLEVEL  ((uint32)0U)
#define MCSPI_CH1CONF_SBPOL_HIGHLEVEL ((uint32)1U)

#define MCSPI_CH1CONF_TCS1_SHIFT         ((uint32)25U)
#define MCSPI_CH1CONF_TCS1_MASK          ((uint32)0x06000000U)
#define MCSPI_CH1CONF_TCS1_THREECYCLEDLY ((uint32)3U)
#define MCSPI_CH1CONF_TCS1_TWOCYCLEDLY   ((uint32)2U)
#define MCSPI_CH1CONF_TCS1_ONECYCLEDLY   ((uint32)1U)
#define MCSPI_CH1CONF_TCS1_ZEROCYCLEDLY  ((uint32)0U)

#define MCSPI_CH1CONF_FFER_SHIFT      ((uint32)28U)
#define MCSPI_CH1CONF_FFER_MASK       ((uint32)0x10000000U)
#define MCSPI_CH1CONF_FFER_FFENABLED  ((uint32)1U)
#define MCSPI_CH1CONF_FFER_FFDISABLED ((uint32)0U)

#define MCSPI_CH1CONF_FFEW_SHIFT      ((uint32)27U)
#define MCSPI_CH1CONF_FFEW_MASK       ((uint32)0x08000000U)
#define MCSPI_CH1CONF_FFEW_FFENABLED  ((uint32)1U)
#define MCSPI_CH1CONF_FFEW_FFDISABLED ((uint32)0U)

#define MCSPI_CH1CONF_CLKG_SHIFT    ((uint32)29U)
#define MCSPI_CH1CONF_CLKG_MASK     ((uint32)0x20000000U)
#define MCSPI_CH1CONF_CLKG_ONECYCLE ((uint32)1U)
#define MCSPI_CH1CONF_CLKG_POWERTWO ((uint32)0U)

#define MCSPI_CH1STAT_RXS_SHIFT ((uint32)0U)
#define MCSPI_CH1STAT_RXS_MASK  ((uint32)0x00000001U)
#define MCSPI_CH1STAT_RXS_EMPTY ((uint32)0U)
#define MCSPI_CH1STAT_RXS_FULL  ((uint32)1U)

#define MCSPI_CH1STAT_EOT_SHIFT      ((uint32)2U)
#define MCSPI_CH1STAT_EOT_MASK       ((uint32)0x00000004U)
#define MCSPI_CH1STAT_EOT_COMPLETED  ((uint32)1U)
#define MCSPI_CH1STAT_EOT_INPROGRESS ((uint32)0U)

#define MCSPI_CH1STAT_RESERVED_2_SHIFT ((uint32)7U)
#define MCSPI_CH1STAT_RESERVED_2_MASK  ((uint32)0xffffff80U)

#define MCSPI_CH1STAT_TXS_SHIFT ((uint32)1U)
#define MCSPI_CH1STAT_TXS_MASK  ((uint32)0x00000002U)
#define MCSPI_CH1STAT_TXS_EMPTY ((uint32)1U)
#define MCSPI_CH1STAT_TXS_FULL  ((uint32)0U)

#define MCSPI_CH1STAT_RXFFE_SHIFT    ((uint32)5U)
#define MCSPI_CH1STAT_RXFFE_MASK     ((uint32)0x00000020U)
#define MCSPI_CH1STAT_RXFFE_EMPTY    ((uint32)1U)
#define MCSPI_CH1STAT_RXFFE_NOTEMPTY ((uint32)0U)

#define MCSPI_CH1STAT_RXFFF_SHIFT   ((uint32)6U)
#define MCSPI_CH1STAT_RXFFF_MASK    ((uint32)0x00000040U)
#define MCSPI_CH1STAT_RXFFF_FULL    ((uint32)1U)
#define MCSPI_CH1STAT_RXFFF_NOTFULL ((uint32)0U)

#define MCSPI_CH1STAT_TXFFE_SHIFT    ((uint32)3U)
#define MCSPI_CH1STAT_TXFFE_MASK     ((uint32)0x00000008U)
#define MCSPI_CH1STAT_TXFFE_EMPTY    ((uint32)1U)
#define MCSPI_CH1STAT_TXFFE_NOTEMPTY ((uint32)0U)

#define MCSPI_CH1STAT_TXFFF_SHIFT   ((uint32)4U)
#define MCSPI_CH1STAT_TXFFF_MASK    ((uint32)0x00000010U)
#define MCSPI_CH1STAT_TXFFF_FULL    ((uint32)1U)
#define MCSPI_CH1STAT_TXFFF_NOTFULL ((uint32)0U)

#define MCSPI_CH1CTRL_RESERVED_1_SHIFT ((uint32)1U)
#define MCSPI_CH1CTRL_RESERVED_1_MASK  ((uint32)0x000000feU)

#define MCSPI_CH1CTRL_EN_SHIFT ((uint32)0U)
#define MCSPI_CH1CTRL_EN_MASK  ((uint32)0x00000001U)
#define MCSPI_CH1CTRL_EN_ACT   ((uint32)1U)
#define MCSPI_CH1CTRL_EN_NACT  ((uint32)0U)

