TexasInstruments/mcal_am263x/mcal/Spi/V0/hw_mcspi.h
#define MCSPI_CH2CONF_FFER_SHIFT      ((uint32)28U)
#define MCSPI_CH2CONF_FFER_MASK       ((uint32)0x10000000U)
#define MCSPI_CH2CONF_FFER_FFENABLED  ((uint32)1U)
#define MCSPI_CH2CONF_FFER_FFDISABLED ((uint32)0U)

#define MCSPI_CH2CONF_FFEW_SHIFT      ((uint32)27U)
#define MCSPI_CH2CONF_FFEW_MASK       ((uint32)0x08000000U)
#define MCSPI_CH2CONF_FFEW_FFENABLED  ((uint32)1U)
#define MCSPI_CH2CONF_FFEW_FFDISABLED ((uint32)0U)

#define MCSPI_CH2CONF_CLKG_SHIFT    ((uint32)29U)
#define MCSPI_CH2CONF_CLKG_MASK     ((uint32)0x20000000U)
#define MCSPI_CH2CONF_CLKG_ONECYCLE ((uint32)1U)
#define MCSPI_CH2CONF_CLKG_POWERTWO ((uint32)0U)

#define MCSPI_CH2STAT_RXS_SHIFT ((uint32)0U)
#define MCSPI_CH2STAT_RXS_MASK  ((uint32)0x00000001U)
#define MCSPI_CH2STAT_RXS_EMPTY ((uint32)0U)
#define MCSPI_CH2STAT_RXS_FULL  ((uint32)1U)

#define MCSPI_CH2STAT_EOT_SHIFT      ((uint32)2U)
#define MCSPI_CH2STAT_EOT_MASK       ((uint32)0x00000004U)
#define MCSPI_CH2STAT_EOT_COMPLETED  ((uint32)1U)
#define MCSPI_CH2STAT_EOT_INPROGRESS ((uint32)0U)

#define MCSPI_CH2STAT_RESERVED_2_SHIFT ((uint32)7U)
#define MCSPI_CH2STAT_RESERVED_2_MASK  ((uint32)0xffffff80U)

#define MCSPI_CH2STAT_TXS_SHIFT ((uint32)1U)
#define MCSPI_CH2STAT_TXS_MASK  ((uint32)0x00000002U)
#define MCSPI_CH2STAT_TXS_EMPTY ((uint32)1U)
#define MCSPI_CH2STAT_TXS_FULL  ((uint32)0U)

#define MCSPI_CH2STAT_RXFFE_SHIFT    ((uint32)5U)
#define MCSPI_CH2STAT_RXFFE_MASK     ((uint32)0x00000020U)
#define MCSPI_CH2STAT_RXFFE_EMPTY    ((uint32)1U)
#define MCSPI_CH2STAT_RXFFE_NOTEMPTY ((uint32)0U)

#define MCSPI_CH2STAT_RXFFF_SHIFT    ((uint32)6U)
#define MCSPI_CH2STAT_RXFFF_MASK     ((uint32)0x00000040U)
#define MCSPI_CH2STAT_RXFFF_FULL     ((uint32)1U)
#define MCSPI_CH2STAT_RXFFF_NOTFULL  ((uint32)0U)
#define MCSPI_CH2STAT_TXFFE_SHIFT    ((uint32)3U)
#define MCSPI_CH2STAT_TXFFE_MASK     ((uint32)0x00000008U)
#define MCSPI_CH2STAT_TXFFE_EMPTY    ((uint32)1U)
#define MCSPI_CH2STAT_TXFFE_NOTEMPTY ((uint32)0U)

#define MCSPI_CH2STAT_TXFFF_SHIFT   ((uint32)4U)
#define MCSPI_CH2STAT_TXFFF_MASK    ((uint32)0x00000010U)
#define MCSPI_CH2STAT_TXFFF_FULL    ((uint32)1U)
#define MCSPI_CH2STAT_TXFFF_NOTFULL ((uint32)0U)

#define MCSPI_CH2CTRL_RESERVED_1_SHIFT ((uint32)1U)
#define MCSPI_CH2CTRL_RESERVED_1_MASK  ((uint32)0x000000feU)

#define MCSPI_CH2CTRL_EN_SHIFT ((uint32)0U)
#define MCSPI_CH2CTRL_EN_MASK  ((uint32)0x00000001U)
#define MCSPI_CH2CTRL_EN_ACT   ((uint32)1U)
#define MCSPI_CH2CTRL_EN_NACT  ((uint32)0U)

#define MCSPI_CH2CTRL_EXTCLK_SHIFT   ((uint32)8U)
#define MCSPI_CH2CTRL_EXTCLK_MASK    ((uint32)0x0000ff00U)
#define MCSPI_CH2CTRL_EXTCLK_EXTZERO ((uint32)0U)
#define MCSPI_CH2CTRL_EXTCLK_EXTONE  ((uint32)1U)
#define MCSPI_CH2CTRL_EXTCLK_EXT4080 ((uint32)255U)

#define MCSPI_CH2CTRL_RESERVED_2_SHIFT ((uint32)16U)
#define MCSPI_CH2CTRL_RESERVED_2_MASK  ((uint32)0xffff0000U)

#define MCSPI_TX2_TDATA_SHIFT ((uint32)0U)
#define MCSPI_TX2_TDATA_MASK  ((uint32)0xffffffffU)

#define MCSPI_RX2_RDATA_SHIFT ((uint32)0U)
#define MCSPI_RX2_RDATA_MASK  ((uint32)0xffffffffU)

#define MCSPI_CH3CONF_CLKD_SHIFT    ((uint32)2U)
#define MCSPI_CH3CONF_CLKD_MASK     ((uint32)0x0000003cU)
#define MCSPI_CH3CONF_CLKD_DIVBY4K  ((uint32)12U)
#define MCSPI_CH3CONF_CLKD_DIVBY8   ((uint32)3U)
#define MCSPI_CH3CONF_CLKD_DIVBY8K  ((uint32)13U)
#define MCSPI_CH3CONF_CLKD_DIVBY2K  ((uint32)11U)
#define MCSPI_CH3CONF_CLKD_DIVBY1K  ((uint32)10U)
#define MCSPI_CH3CONF_CLKD_DIVBY512 ((uint32)9U)
#define MCSPI_CH3CONF_CLKD_DIVBY32K ((uint32)15U)
#define MCSPI_CH3CONF_CLKD_DIVBY4   ((uint32)2U)
#define MCSPI_CH3CONF_CLKD_DIVBY1   ((uint32)0U)
#define MCSPI_CH3CONF_CLKD_DIVBY64  ((uint32)6U)
#define MCSPI_CH3CONF_CLKD_DIVBY256 ((uint32)8U)
#define MCSPI_CH3CONF_CLKD_DIVBY128 ((uint32)7U)
#define MCSPI_CH3CONF_CLKD_DIVBY32  ((uint32)5U)
#define MCSPI_CH3CONF_CLKD_DIVBY16K ((uint32)14U)
#define MCSPI_CH3CONF_CLKD_DIVBY16  ((uint32)4U)
#define MCSPI_CH3CONF_CLKD_DIVBY2   ((uint32)1U)

#define MCSPI_CH3CONF_RESERVED_0_SHIFT ((uint32)30U)
#define MCSPI_CH3CONF_RESERVED_0_MASK  ((uint32)0xc0000000U)

#define MCSPI_CH3CONF_PHA_SHIFT ((uint32)0U)
#define MCSPI_CH3CONF_PHA_MASK  ((uint32)0x00000001U)
#define MCSPI_CH3CONF_PHA_ODD   ((uint32)0U)
#define MCSPI_CH3CONF_PHA_EVEN  ((uint32)1U)

#define MCSPI_CH3CONF_TURBO_SHIFT ((uint32)19U)
#define MCSPI_CH3CONF_TURBO_MASK  ((uint32)0x00080000U)
#define MCSPI_CH3CONF_TURBO_TURBO ((uint32)1U)
#define MCSPI_CH3CONF_TURBO_OFF   ((uint32)0U)

#define MCSPI_CH3CONF_RESERVED_1_SHIFT ((uint32)21U)
#define MCSPI_CH3CONF_RESERVED_1_MASK  ((uint32)0x00600000U)

#define MCSPI_CH3CONF_DPE0_SHIFT    ((uint32)16U)
#define MCSPI_CH3CONF_DPE0_MASK     ((uint32)0x00010000U)
#define MCSPI_CH3CONF_DPE0_DISABLED ((uint32)1U)
#define MCSPI_CH3CONF_DPE0_ENABLED  ((uint32)0U)

#define MCSPI_CH3CONF_IS_SHIFT ((uint32)18U)
#define MCSPI_CH3CONF_IS_MASK  ((uint32)0x00040000U)
#define MCSPI_CH3CONF_IS_LINE0 ((uint32)0U)
#define MCSPI_CH3CONF_IS_LINE1 ((uint32)1U)

#define MCSPI_CH3CONF_DMAR_SHIFT    ((uint32)15U)
#define MCSPI_CH3CONF_DMAR_MASK     ((uint32)0x00008000U)
#define MCSPI_CH3CONF_DMAR_DISABLED ((uint32)0U)
#define MCSPI_CH3CONF_DMAR_ENABLED  ((uint32)1U)

#define MCSPI_CH3CONF_FORCE_SHIFT    ((uint32)20U)
#define MCSPI_CH3CONF_FORCE_MASK     ((uint32)0x00100000U)
#define MCSPI_CH3CONF_FORCE_DEASSERT ((uint32)0U)
#define MCSPI_CH3CONF_FORCE_ASSERT   ((uint32)1U)

#define MCSPI_CH3CONF_WL_SHIFT  ((uint32)7U)
#define MCSPI_CH3CONF_WL_MASK   ((uint32)0x00000f80U)
#define MCSPI_CH3CONF_WL_21BITS ((uint32)20U)
#define MCSPI_CH3CONF_WL_26BITS ((uint32)25U)
#define MCSPI_CH3CONF_WL_18BITS ((uint32)17U)
#define MCSPI_CH3CONF_WL_20BITS ((uint32)19U)
#define MCSPI_CH3CONF_WL_5BITS  ((uint32)4U)
#define MCSPI_CH3CONF_WL_6BITS  ((uint32)5U)
#define MCSPI_CH3CONF_WL_11BITS ((uint32)10U)
#define MCSPI_CH3CONF_WL_8BITS  ((uint32)7U)
#define MCSPI_CH3CONF_WL_13BITS ((uint32)12U)
#define MCSPI_CH3CONF_WL_29BITS ((uint32)28U)
#define MCSPI_CH3CONF_WL_12BITS ((uint32)11U)
#define MCSPI_CH3CONF_WL_32BITS ((uint32)31U)
#define MCSPI_CH3CONF_WL_31BITS ((uint32)30U)
#define MCSPI_CH3CONF_WL_30BITS ((uint32)29U)
#define MCSPI_CH3CONF_WL_9BITS  ((uint32)8U)
#define MCSPI_CH3CONF_WL_7BITS  ((uint32)6U)
#define MCSPI_CH3CONF_WL_10BITS ((uint32)9U)
#define MCSPI_CH3CONF_WL_16BITS ((uint32)15U)
#define MCSPI_CH3CONF_WL_17BITS ((uint32)16U)
#define MCSPI_CH3CONF_WL_14BITS ((uint32)13U)
#define MCSPI_CH3CONF_WL_15BITS ((uint32)14U)
#define MCSPI_CH3CONF_WL_RSVD1  ((uint32)1U)
#define MCSPI_CH3CONF_WL_RSVD0  ((uint32)0U)
#define MCSPI_CH3CONF_WL_27BITS ((uint32)26U)
#define MCSPI_CH3CONF_WL_23BITS ((uint32)22U)
#define MCSPI_CH3CONF_WL_RSVD2  ((uint32)2U)
#define MCSPI_CH3CONF_WL_19BITS ((uint32)18U)
#define MCSPI_CH3CONF_WL_4BITS  ((uint32)3U)
#define MCSPI_CH3CONF_WL_25BITS ((uint32)24U)
#define MCSPI_CH3CONF_WL_24BITS ((uint32)23U)
#define MCSPI_CH3CONF_WL_22BITS ((uint32)21U)
#define MCSPI_CH3CONF_WL_28BITS ((uint32)27U)

