TexasInstruments/mcal_am263x/mcal/Spi/V0/hw_mcspi.h
#define MCSPI_CH3CONF_DPE1_SHIFT    ((uint32)17U)
#define MCSPI_CH3CONF_DPE1_MASK     ((uint32)0x00020000U)
#define MCSPI_CH3CONF_DPE1_ENABLED  ((uint32)0U)
#define MCSPI_CH3CONF_DPE1_DISABLED ((uint32)1U)

#define MCSPI_CH3CONF_EPOL_SHIFT      ((uint32)6U)
#define MCSPI_CH3CONF_EPOL_MASK       ((uint32)0x00000040U)
#define MCSPI_CH3CONF_EPOL_ACTIVELOW  ((uint32)1U)
#define MCSPI_CH3CONF_EPOL_ACTIVEHIGH ((uint32)0U)

#define MCSPI_CH3CONF_DMAW_SHIFT    ((uint32)14U)
#define MCSPI_CH3CONF_DMAW_MASK     ((uint32)0x00004000U)
#define MCSPI_CH3CONF_DMAW_ENABLED  ((uint32)1U)
#define MCSPI_CH3CONF_DMAW_DISABLED ((uint32)0U)

#define MCSPI_CH3CONF_TRM_SHIFT      ((uint32)12U)
#define MCSPI_CH3CONF_TRM_MASK       ((uint32)0x00003000U)
#define MCSPI_CH3CONF_TRM_TRANSONLY  ((uint32)2U)
#define MCSPI_CH3CONF_TRM_RSVD       ((uint32)3U)
#define MCSPI_CH3CONF_TRM_TRANSRECEI ((uint32)0U)
#define MCSPI_CH3CONF_TRM_RECEIVONLY ((uint32)1U)

#define MCSPI_CH3CONF_POL_SHIFT      ((uint32)1U)
#define MCSPI_CH3CONF_POL_MASK       ((uint32)0x00000002U)
#define MCSPI_CH3CONF_POL_ACTIVELOW  ((uint32)1U)
#define MCSPI_CH3CONF_POL_ACTIVEHIGH ((uint32)0U)

#define MCSPI_CH3CONF_SBE_SHIFT    ((uint32)23U)
#define MCSPI_CH3CONF_SBE_MASK     ((uint32)0x00800000U)
#define MCSPI_CH3CONF_SBE_DISABLED ((uint32)0U)
#define MCSPI_CH3CONF_SBE_ENABLED  ((uint32)1U)

#define MCSPI_CH3CONF_SBPOL_SHIFT     ((uint32)24U)
#define MCSPI_CH3CONF_SBPOL_MASK      ((uint32)0x01000000U)
#define MCSPI_CH3CONF_SBPOL_LOWLEVEL  ((uint32)0U)
#define MCSPI_CH3CONF_SBPOL_HIGHLEVEL ((uint32)1U)

#define MCSPI_CH3CONF_TCS3_SHIFT         ((uint32)25U)
#define MCSPI_CH3CONF_TCS3_MASK          ((uint32)0x06000000U)
#define MCSPI_CH3CONF_TCS3_THREECYCLEDLY ((uint32)3U)
#define MCSPI_CH3CONF_TCS3_TWOCYCLEDLY   ((uint32)2U)
#define MCSPI_CH3CONF_TCS3_ONECYCLEDLY   ((uint32)1U)
#define MCSPI_CH3CONF_TCS3_ZEROCYCLEDLY  ((uint32)0U)

#define MCSPI_CH3CONF_FFER_SHIFT      ((uint32)28U)
#define MCSPI_CH3CONF_FFER_MASK       ((uint32)0x10000000U)
#define MCSPI_CH3CONF_FFER_FFENABLED  ((uint32)1U)
#define MCSPI_CH3CONF_FFER_FFDISABLED ((uint32)0U)

#define MCSPI_CH3CONF_FFEW_SHIFT      ((uint32)27U)
#define MCSPI_CH3CONF_FFEW_MASK       ((uint32)0x08000000U)
#define MCSPI_CH3CONF_FFEW_FFENABLED  ((uint32)1U)
#define MCSPI_CH3CONF_FFEW_FFDISABLED ((uint32)0U)

#define MCSPI_CH3CONF_CLKG_SHIFT    ((uint32)29U)
#define MCSPI_CH3CONF_CLKG_MASK     ((uint32)0x20000000U)
#define MCSPI_CH3CONF_CLKG_ONECYCLE ((uint32)1U)
#define MCSPI_CH3CONF_CLKG_POWERTWO ((uint32)0U)

#define MCSPI_CH3STAT_RXS_SHIFT ((uint32)0U)
#define MCSPI_CH3STAT_RXS_MASK  ((uint32)0x00000001U)
#define MCSPI_CH3STAT_RXS_EMPTY ((uint32)0U)
#define MCSPI_CH3STAT_RXS_FULL  ((uint32)1U)

#define MCSPI_CH3STAT_EOT_SHIFT      ((uint32)2U)
#define MCSPI_CH3STAT_EOT_MASK       ((uint32)0x00000004U)
#define MCSPI_CH3STAT_EOT_COMPLETED  ((uint32)1U)
#define MCSPI_CH3STAT_EOT_INPROGRESS ((uint32)0U)

#define MCSPI_CH3STAT_RESERVED_2_SHIFT ((uint32)7U)
#define MCSPI_CH3STAT_RESERVED_2_MASK  ((uint32)0xffffff80U)

#define MCSPI_CH3STAT_TXS_SHIFT ((uint32)1U)
#define MCSPI_CH3STAT_TXS_MASK  ((uint32)0x00000002U)
#define MCSPI_CH3STAT_TXS_EMPTY ((uint32)1U)
#define MCSPI_CH3STAT_TXS_FULL  ((uint32)0U)

#define MCSPI_CH3STAT_RXFFE_SHIFT    ((uint32)5U)
#define MCSPI_CH3STAT_RXFFE_MASK     ((uint32)0x00000020U)
#define MCSPI_CH3STAT_RXFFE_EMPTY    ((uint32)1U)
#define MCSPI_CH3STAT_RXFFE_NOTEMPTY ((uint32)0U)
#define MCSPI_CH3STAT_RXFFF_SHIFT    ((uint32)6U)
#define MCSPI_CH3STAT_RXFFF_MASK     ((uint32)0x00000040U)
#define MCSPI_CH3STAT_RXFFF_FULL     ((uint32)1U)
#define MCSPI_CH3STAT_RXFFF_NOTFULL  ((uint32)0U)

#define MCSPI_CH3STAT_TXFFE_SHIFT    ((uint32)3U)
#define MCSPI_CH3STAT_TXFFE_MASK     ((uint32)0x00000008U)
#define MCSPI_CH3STAT_TXFFE_EMPTY    ((uint32)1U)
#define MCSPI_CH3STAT_TXFFE_NOTEMPTY ((uint32)0U)

#define MCSPI_CH3STAT_TXFFF_SHIFT   ((uint32)4U)
#define MCSPI_CH3STAT_TXFFF_MASK    ((uint32)0x00000010U)
#define MCSPI_CH3STAT_TXFFF_FULL    ((uint32)1U)
#define MCSPI_CH3STAT_TXFFF_NOTFULL ((uint32)0U)

#define MCSPI_CH3CTRL_RESERVED_1_SHIFT ((uint32)1U)
#define MCSPI_CH3CTRL_RESERVED_1_MASK  ((uint32)0x000000feU)

#define MCSPI_CH3CTRL_EN_SHIFT ((uint32)0U)
#define MCSPI_CH3CTRL_EN_MASK  ((uint32)0x00000001U)
#define MCSPI_CH3CTRL_EN_ACT   ((uint32)1U)
#define MCSPI_CH3CTRL_EN_NACT  ((uint32)0U)

#define MCSPI_CH3CTRL_EXTCLK_SHIFT   ((uint32)8U)
#define MCSPI_CH3CTRL_EXTCLK_MASK    ((uint32)0x0000ff00U)
#define MCSPI_CH3CTRL_EXTCLK_EXTZERO ((uint32)0U)
#define MCSPI_CH3CTRL_EXTCLK_EXTONE  ((uint32)1U)
#define MCSPI_CH3CTRL_EXTCLK_EXT4080 ((uint32)255U)

#define MCSPI_CH3CTRL_RESERVED_2_SHIFT ((uint32)16U)
#define MCSPI_CH3CTRL_RESERVED_2_MASK  ((uint32)0xffff0000U)

#define MCSPI_TX3_TDATA_SHIFT ((uint32)0U)
#define MCSPI_TX3_TDATA_MASK  ((uint32)0xffffffffU)

#define MCSPI_RX3_RDATA_SHIFT ((uint32)0U)
#define MCSPI_RX3_RDATA_MASK  ((uint32)0xffffffffU)

#define MCSPI_XFERLEVEL_AEL_SHIFT    ((uint32)0U)
#define MCSPI_XFERLEVEL_AEL_MASK     ((uint32)0x000000ffU)
#define MCSPI_XFERLEVEL_AEL_256BYTES ((uint32)255U)
#define MCSPI_XFERLEVEL_AEL_255BYTES ((uint32)254U)
#define MCSPI_XFERLEVEL_AEL_2BYTES   ((uint32)1U)
#define MCSPI_XFERLEVEL_AEL_1BYTE    ((uint32)0U)

#define MCSPI_XFERLEVEL_WCNT_SHIFT     ((uint32)16U)
#define MCSPI_XFERLEVEL_WCNT_MASK      ((uint32)0xffff0000U)
#define MCSPI_XFERLEVEL_WCNT_65535WORD ((uint32)65535U)
#define MCSPI_XFERLEVEL_WCNT_65534WORD ((uint32)65534U)
#define MCSPI_XFERLEVEL_WCNT_1WORD     ((uint32)1U)
#define MCSPI_XFERLEVEL_WCNT_DISABLE   ((uint32)0U)

#define MCSPI_XFERLEVEL_AFL_SHIFT    ((uint32)8U)
#define MCSPI_XFERLEVEL_AFL_MASK     ((uint32)0x0000ff00U)
#define MCSPI_XFERLEVEL_AFL_256BYTES ((uint32)255U)
#define MCSPI_XFERLEVEL_AFL_255BYTES ((uint32)254U)
#define MCSPI_XFERLEVEL_AFL_2BYTES   ((uint32)1U)
#define MCSPI_XFERLEVEL_AFL_1BYTE    ((uint32)0U)

#ifdef __cplusplus
}
#endif
#endif /* _HW_MCSPI_H_ */
